// utils.js (簡便に動かすため、exportは使わない CORS)
//export const APP_VERSION = "1.0.1";
const APP_VERSION = "1.0.1";


let g_util_visitedPlaces = null;

// データを取得して 配列に戻す
function util_loadCheckinPlace(){
    const savedData = localStorage.getItem('visitedPlaces');
    g_util_visitedPlaces = JSON.parse(savedData);
    if (g_util_visitedPlaces == null) {
        g_util_visitedPlaces = [];
    }
//    alert(g_util_visitedPlaces);
}

// 配列をデータとしてセーブする
function util_saveCheckinPlace(){
    // 配列を JSON文字列に変換して保存
    localStorage.setItem('visitedPlaces', JSON.stringify(g_util_visitedPlaces));
}

function util_checkinPlace(id) {

    util_loadCheckinPlace();

    if (g_util_visitedPlaces.includes(id)) {
        return;
    }

    g_util_visitedPlaces.push(id);

    util_saveCheckinPlace();
}

function util_removePlace(id) {

    util_loadCheckinPlace();

    if (!g_util_visitedPlaces.includes(id)) {
        return;
    }

    g_util_visitedPlaces.pop(id);

    util_saveCheckinPlace();
}

g_util_locations = [
  { "id": "test01", "pref": "三重", "name": "ガリバーと遊ぶ（4桁）", "lat": 34.4707, "lng": 136.8483},
  { "id": "test02", "pref": "三重", "name": "ガリバーと遊ぶ（詳細）", "lat": 34.47070203531705, "lng": 136.8483125490192},
  { "id": "test03", "pref": "神奈川", "name": "久良岐公園で遊ぶ", "lat": 35.40383029889338, "lng": 139.60751868148557},
  { "id": "四国遍路01", "pref": "徳島", "name": "霊山寺を参拝する", "lat": 34.1594, "lng": 134.5028 },
  { "id": "四国遍路02", "pref": "徳島", "name": "極楽寺を参拝する", "lat": 34.1558, "lng": 134.4914 },
  { "id": "四国遍路03", "pref": "徳島", "name": "金泉寺を参拝する", "lat": 34.1461, "lng": 134.4608 },
  { "id": "四国遍路04", "pref": "徳島", "name": "大日寺を参拝する", "lat": 34.1519, "lng": 134.4251 },
  { "id": "四国遍路05", "pref": "徳島", "name": "地蔵寺を参拝する", "lat": 34.1386, "lng": 134.4293 },
  { "id": "四国遍路06", "pref": "徳島", "name": "安楽寺を参拝する", "lat": 34.1166, "lng": 134.3892 },
  { "id": "四国遍路07", "pref": "徳島", "name": "十楽寺を参拝する", "lat": 34.1158, "lng": 134.3751 },
  { "id": "四国遍路08", "pref": "徳島", "name": "熊谷寺を参拝する", "lat": 34.1245, "lng": 134.3385 },
  { "id": "四国遍路09", "pref": "徳島", "name": "法輪寺を参拝する", "lat": 34.1047, "lng": 134.3364 },
  { "id": "四国遍路10", "pref": "徳島", "name": "切幡寺を参拝する", "lat": 34.1084, "lng": 134.3056 },
  { "id": "四国遍路11", "pref": "徳島", "name": "藤井寺を参拝する", "lat": 34.0536, "lng": 134.3541 },
  { "id": "四国遍路12", "pref": "徳島", "name": "焼山寺を参拝する", "lat": 33.9859, "lng": 134.3129 },
  { "id": "四国遍路13", "pref": "徳島", "name": "大日寺を参拝する", "lat": 34.0375, "lng": 134.4533 },
  { "id": "四国遍路14", "pref": "徳島", "name": "常楽寺を参拝する", "lat": 34.0416, "lng": 134.4842 },
  { "id": "四国遍路15", "pref": "徳島", "name": "国分寺を参拝する", "lat": 34.0538, "lng": 134.4716 },
  { "id": "四国遍路16", "pref": "徳島", "name": "観音寺を参拝する", "lat": 34.0628, "lng": 134.5028 },
  { "id": "四国遍路17", "pref": "徳島", "name": "井戸寺を参拝する", "lat": 34.0759, "lng": 134.5103 },
  { "id": "四国遍路18", "pref": "徳島", "name": "恩山寺を参拝する", "lat": 33.9926, "lng": 134.5779 },
  { "id": "四国遍路19", "pref": "徳島", "name": "立江寺を参拝する", "lat": 33.9678, "lng": 134.6068 },
  { "id": "四国遍路20", "pref": "徳島", "name": "鶴林寺を参拝する", "lat": 33.9118, "lng": 134.5054 },
  { "id": "四国遍路21", "pref": "徳島", "name": "太龍寺を参拝する", "lat": 33.8821, "lng": 134.5197 },
  { "id": "四国遍路22", "pref": "徳島", "name": "平等寺を参拝する", "lat": 33.8569, "lng": 134.6025 },
  { "id": "四国遍路23", "pref": "徳島", "name": "薬王寺を参拝する", "lat": 33.7314, "lng": 134.5451 },
  { "id": "四国遍路24", "pref": "高知", "name": "最御崎寺を参拝する", "lat": 33.2494, "lng": 134.1764 },
  { "id": "四国遍路25", "pref": "高知", "name": "津照寺を参拝する", "lat": 33.2878, "lng": 134.1507 },
  { "id": "四国遍路26", "pref": "高知", "name": "金剛頂寺を参拝する", "lat": 33.3039, "lng": 134.1166 },
  { "id": "四国遍路27", "pref": "高知", "name": "神峯寺を参拝する", "lat": 33.3888, "lng": 133.9782 },
  { "id": "四国遍路28", "pref": "高知", "name": "大日寺を参拝する", "lat": 33.6064, "lng": 133.7229 },
  { "id": "四国遍路29", "pref": "高知", "name": "国分寺を参拝する", "lat": 33.5992, "lng": 133.6457 },
  { "id": "四国遍路30", "pref": "高知", "name": "善楽寺を参拝する", "lat": 33.5925, "lng": 133.5786 },
  { "id": "四国遍路31", "pref": "高知", "name": "竹林寺を参拝する", "lat": 33.5463, "lng": 133.5775 },
  { "id": "四国遍路32", "pref": "高知", "name": "禅師峰寺を参拝する", "lat": 33.5269, "lng": 133.6074 },
  { "id": "四国遍路33", "pref": "高知", "name": "雪蹊寺を参拝する", "lat": 33.5019, "lng": 133.5583 },
  { "id": "四国遍路34", "pref": "高知", "name": "種間寺を参拝する", "lat": 33.4913, "lng": 133.5009 },
  { "id": "四国遍路35", "pref": "高知", "name": "清瀧寺を参拝する", "lat": 33.5074, "lng": 133.4079 },
  { "id": "四国遍路36", "pref": "高知", "name": "青龍寺を参拝する", "lat": 33.4357, "lng": 133.4425 },
  { "id": "四国遍路37", "pref": "高知", "name": "岩本寺を参拝する", "lat": 33.2096, "lng": 133.1345 },
  { "id": "四国遍路38", "pref": "高知", "name": "金剛福寺を参拝する", "lat": 32.7247, "lng": 133.0253 },
  { "id": "四国遍路39", "pref": "高知", "name": "延光寺を参拝する", "lat": 32.9304, "lng": 132.7758 },
  { "id": "四国遍路40", "pref": "愛媛", "name": "観自在寺を参拝する", "lat": 32.9625, "lng": 132.5645 },
  { "id": "四国遍路41", "pref": "愛媛", "name": "龍光寺を参拝する", "lat": 33.2965, "lng": 132.6105 },
  { "id": "四国遍路42", "pref": "愛媛", "name": "佛木寺を参拝する", "lat": 33.3101, "lng": 132.5802 },
  { "id": "四国遍路43", "pref": "愛媛", "name": "明石寺を参拝する", "lat": 33.3664, "lng": 132.5159 },
  { "id": "四国遍路44", "pref": "愛媛", "name": "大寶寺を参拝する", "lat": 33.6558, "lng": 132.9069 },
  { "id": "四国遍路45", "pref": "愛媛", "name": "岩屋寺を参拝する", "lat": 33.6703, "lng": 132.9842 },
  { "id": "四国遍路46", "pref": "愛媛", "name": "浄瑠璃寺を参拝する", "lat": 33.7533, "lng": 132.8122 },
  { "id": "四国遍路47", "pref": "愛媛", "name": "八坂寺を参拝する", "lat": 33.7611, "lng": 132.8115 },
  { "id": "四国遍路48", "pref": "愛媛", "name": "西林寺を参拝する", "lat": 33.7915, "lng": 132.8174 },
  { "id": "四国遍路49", "pref": "愛媛", "name": "浄土寺を参拝する", "lat": 33.8169, "lng": 132.8128 },
  { "id": "四国遍路50", "pref": "愛媛", "name": "繁多寺を参拝する", "lat": 33.8277, "lng": 132.8015 },
  { "id": "四国遍路51", "pref": "愛媛", "name": "石手寺を参拝する", "lat": 33.8477, "lng": 132.7966 },
  { "id": "四国遍路52", "pref": "愛媛", "name": "太山寺を参拝する", "lat": 33.8824, "lng": 132.7118 },
  { "id": "四国遍路53", "pref": "愛媛", "name": "圓明寺を参拝する", "lat": 33.8903, "lng": 132.7381 },
  { "id": "四国遍路54", "pref": "愛媛", "name": "延命寺を参拝する", "lat": 34.0298, "lng": 132.9774 },
  { "id": "四国遍路55", "pref": "愛媛", "name": "南光坊を参拝する", "lat": 34.0664, "lng": 133.0031 },
  { "id": "四国遍路56", "pref": "愛媛", "name": "泰山寺を参拝する", "lat": 34.0504, "lng": 132.9723 },
  { "id": "四国遍路57", "pref": "愛媛", "name": "栄福寺を参拝する", "lat": 34.0326, "lng": 132.9644 },
  { "id": "四国遍路58", "pref": "愛媛", "name": "仙遊寺を参拝する", "lat": 34.0152, "lng": 132.9612 },
  { "id": "四国遍路59", "pref": "愛媛", "name": "国分寺を参拝する", "lat": 34.0259, "lng": 133.0253 },
  { "id": "四国遍路60", "pref": "愛媛", "name": "横峰寺を参拝する", "lat": 33.8519, "lng": 133.1118 },
  { "id": "四国遍路61", "pref": "愛媛", "name": "香園寺を参拝する", "lat": 33.8967, "lng": 133.1042 },
  { "id": "四国遍路62", "pref": "愛媛", "name": "宝寿寺を参拝する", "lat": 33.8964, "lng": 133.1158 },
  { "id": "四国遍路63", "pref": "愛媛", "name": "吉祥寺を参拝する", "lat": 33.8942, "lng": 133.1252 },
  { "id": "四国遍路64", "pref": "愛媛", "name": "前神寺を参拝する", "lat": 33.8893, "lng": 133.1594 },
  { "id": "四国遍路65", "pref": "愛媛", "name": "三角寺を参拝する", "lat": 33.9657, "lng": 133.5786 },
  { "id": "四国遍路66", "pref": "香川", "name": "雲辺寺を参拝する", "lat": 34.0347, "lng": 133.7228 },
  { "id": "四国遍路67", "pref": "香川", "name": "大興寺を参拝する", "lat": 34.0416, "lng": 133.7118 },
  { "id": "四国遍路68", "pref": "香川", "name": "神恵院を参拝する", "lat": 34.1337, "lng": 133.6469 },
  { "id": "四国遍路69", "pref": "香川", "name": "観音寺を参拝する", "lat": 34.1337, "lng": 133.6469 },
  { "id": "四国遍路70", "pref": "香川", "name": "本山寺を参拝する", "lat": 34.1361, "lng": 133.6931 },
  { "id": "四国遍路71", "pref": "香川", "name": "弥谷寺を参拝する", "lat": 34.2291, "lng": 133.7314 },
  { "id": "四国遍路72", "pref": "香川", "name": "曼荼羅寺を参拝する", "lat": 34.2215, "lng": 133.7431 },
  { "id": "四国遍路73", "pref": "香川", "name": "出釈迦寺を参拝する", "lat": 34.2178, "lng": 133.7419 },
  { "id": "四国遍路74", "pref": "香川", "name": "甲山寺を参拝する", "lat": 34.2325, "lng": 133.7667 },
  { "id": "四国遍路75", "pref": "香川", "name": "善通寺を参拝する", "lat": 34.2251, "lng": 133.7741 },
  { "id": "四国遍路76", "pref": "香川", "name": "金倉寺を参拝する", "lat": 34.2541, "lng": 133.7828 },
  { "id": "四国遍路77", "pref": "香川", "name": "道隆寺を参拝する", "lat": 34.2694, "lng": 133.7831 },
  { "id": "四国遍路78", "pref": "香川", "name": "郷照寺を参拝する", "lat": 34.3056, "lng": 133.8164 },
  { "id": "四国遍路79", "pref": "香川", "name": "天皇寺を参拝する", "lat": 34.3168, "lng": 133.8778 },
  { "id": "四国遍路80", "pref": "香川", "name": "國分寺を参拝する", "lat": 34.3005, "lng": 133.9483 },
  { "id": "四国遍路81", "pref": "香川", "name": "白峯寺を参拝する", "lat": 34.3364, "lng": 133.9275 },
  { "id": "四国遍路82", "pref": "香川", "name": "根香寺を参拝する", "lat": 34.3411, "lng": 133.9583 },
  { "id": "四国遍路83", "pref": "香川", "name": "一宮寺を参拝する", "lat": 34.2917, "lng": 134.0322 },
  { "id": "四国遍路84", "pref": "香川", "name": "屋島寺を参拝する", "lat": 34.3578, "lng": 134.1017 },
  { "id": "四国遍路85", "pref": "香川", "name": "八栗寺を参拝する", "lat": 34.3592, "lng": 134.1311 },
  { "id": "四国遍路86", "pref": "香川", "name": "志度寺を参拝する", "lat": 34.3242, "lng": 134.1751 },
  { "id": "四国遍路87", "pref": "香川", "name": "長尾寺を参拝する", "lat": 34.2665, "lng": 134.1743 },
  { "id": "四国遍路88", "pref": "香川", "name": "大窪寺を参拝する", "lat": 34.1884, "lng": 134.2081 },
  { "id": "三大牛01", "pref": "三重", "name": "松坂牛を食べる", "lat": 34.57806244476445, "lng": 136.52773901136786 }, 
  { "id": "三大牛02", "pref": "兵庫", "name": "神戸牛を食べる", "lat": 34.68967112987455, "lng": 135.19573899602892 }, 
  { "id": "三大牛03", "pref": "滋賀", "name": "近江牛を食べる", "lat": 35.12841521714161, "lng": 136.09772869604774 }, 
  { "id": "神宮01", "pref": "三重", "name": "伊勢神宮を参拝する", "lat": 34.45883071795521, "lng": 136.7231841680958 },
  { "id": "豚01", "pref": "鹿児島", "name": "黒豚を食べる", "lat": 31.59680084840356, "lng": 130.5571449112469 }, 
  { "id": "豚02", "pref": "山形", "name": "三元豚を食べる", "lat": 38.25548916975718, "lng": 140.33957229618818 }, 
  { "id": "豚03", "pref": "東京", "name": "TOKYO Xを食べる", "lat": 35.68968980496082, "lng": 139.69163265189235 }, 
  { "id": "中華街01", "pref": "神奈川", "name": "横浜中華街を観光する", "lat": 35.44328930842758, "lng": 139.64411082489727 }, 
  { "id": "中華街02", "pref": "兵庫", "name": "南京町を観光する", "lat": 34.68848765152299, "lng": 135.18838934576345 }, 
  { "id": "中華街03", "pref": "長崎", "name": "新地中華街を観光する", "lat": 32.74166447512743, "lng": 129.87530877478432 },
  { "id": "名所01", "pref": "福井", "name": "東尋坊を観光する", "lat": 36.238176785386784, "lng": 136.12666145270623 },
  { "id": "名所02", "pref": "宮崎", "name": "高千穂峡を観光する", "lat": 32.70154852234513, "lng": 131.3003302290169 },
  { "id": "名所03", "pref": "沖縄", "name": "守礼門を観光する", "lat": 26.218294777574346, "lng": 127.71691811105664 },
  { "id": "名所04", "pref": "北海道", "name": "時計台を観光する", "lat": 43.06274482729268, "lng": 141.35350845409792 },
  { "id": "名所05", "pref": "高知", "name": "はりまや橋を観光する", "lat": 33.560092660431096, "lng": 133.54270558248948 },
  { "id": "名所06", "pref": "北海道", "name": "宗谷岬を観光する", "lat": 45.52550236125148, "lng": 141.93709180007255 }
  
];


